app/views/posts/_form.html.erb

SELECT "authors".* FROM "authors"
---
  % if @post.author.nil? %>
  <%= f.select :author_id, options_from_collection_for_select(Author.all, :id, :name) %><br>